app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)
    @post.user = current_user
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["body", "gndfgdfg"], ["created_at", "2020-07-22 20:58:16.946858"], ["updated_at", "2020-07-22 20:58:16.946858"], ["user_id", 3]]